{
  "sk": {
    "title_index": "Domovská stránka",
    "menu_item_1": "Úvod",
    "menu_item_2": "Základné informácie",
    "menu_item_3": "Kremík",
    "menu_item_4": "Germánium",
    "menu_item_5": "Arzenid galitý",
    "menu_item_6": "Karbid kremičitý",
    "menu_item_7": "Gálium nitrid",
    "menu_item_8": "Organické polovodiče",
    "title_1": "Vitajte vo svete polovodičov!",
    "card_title_1": "Základné informácie",
    "card_button_1": "Zistiť viac",
    "card_title_2": "Kremík - kráľ polovodičov",
    "card_button_2": "Zistiť viac",
    "card_title_3": "Germánium",
    "card_button_3": "Zistiť viac",
    "card_title_4": "Arzenid galitý",
    "card_button_4": "Zistiť viac",
    "card_title_5": "Karbid kremičitý",
    "card_button_5": "Zistiť viac",
    "card_title_6": "Gálium nitrid",
    "card_button_6": "Zistiť viac",
    "card_title_7": "Organické polovodiče",
    "card_button_7": "Zistiť viac",

    "title_uvod": "Čo sú to polovodiče?",
    "title_2": "Čo sú to polovodiče?",
    "first_list_1": "Objav polovodičov je považovaný za významný objav s veľkým využitím v súčasnosti.",
    "first_list_2": "Polovodiče majú mnohé vlastnosti, ktoré ich robia dôležitými v rôznych oblastiach, vrátane elektroniky, elektrotechniky, zobrazovacej techniky, solárnych článkov a atómových batérií.",
    "first_list_3": "Pre pochopenie využitia polovodičov je dôležné mať základné poznatky o ich elektrónovej štruktúre.",
    "carousel_item_1": "Solárne články",
    "carousel_item_2": "Diódy",
    "carousel_item_3": "Lasery",
    "second_list_1": "Polovodiče sú materiály, ktoré sa nachádzajú medzi vodičmi a nevodičmi z hľadiska elektrickej vodivosti.",
    "second_list_2": "Ich elektrická vodivosť sa mení v závislosti na teplote, osvetlení, usporiadaní kryštalickej mriežky a prítomnosti prímesí.",
    "second_list_3": "Polovodiče majú valenčné elektróny, ktoré môžu prejsť do vodivostného pásma a pohybovať sa voľne, ak dostanú energiu, ktorá presahuje energetickú medzeru medzi týmito pásmami.",
    "second_list_4": "Šírka tejto medzery určuje elektrickú vodivosť látky, pričom u vodičov je táto medzera nulová, zatiaľ čo u nevodičov je veľká.",
    "second_list_5": "Polovodiče majú schopnosť viesť veľké prúdy a majú nízky odpor pri vyšších teplotách.",
    "title_3": "História polovodičov",
    "third_list_1": "Niektoré z významných vlastností polovodičov boli známe už pomerne dávno.",
    "third_list_2": "Fotoelektrické vlastnosti selénu sa vyšetrovali už v 60. rokoch 19. storočia.",
    "third_list_3": "Koncom 19. a začiatkom 20. storočia sa vyšetrujú vlastnosti polárnych polovodičov a usmerňovacie účinky niektorých oxidov.",
    "third_list_4": "Z Cu2O sa r. 1926 vyhotovil prvý technický upotrebiteľný usmerňovač.",
    "third_list_5": "Z toho istého polovodiča sa r. 1932 vyrobil aj fotočlánok.",
    "third_list_6": "Napriek týmto sporadickým úspechom sa vlastné dejiny polovodičov začínajú fakticky až v polovici 20. storočia.",
    "third_list_7": "Prvým predpokladom praktického upotrebenia polovodičových materiálov, najmä chemických jedincov, je takmer dokonalá čistota.",
    "third_list_8": "Obrovský rozvoj v technickej aplikácii polovodičov nastal od r. 1948.",
    "third_list_9": "Prvý tranzistor, aktívna polovodičová súčiastka prevažne s tromi elektródami, bola vyrobený v tomto období. Tranzistor slúži na spracovanie signálov, napríklad na generovanie a zosilnenie elektrických signálov, premenu neelektrických signálov na elektrické a pod.",
    "title_4": "Aké látky patria k polovodičom?",
    "fourth_list_1": "Odpoveď na túto otázku sa komplikovala tým viac, čím viac sa polovodiče preskúmali.",
    "fourth_list_2": "Na začiatku polovodičovej éry stačilo povedať, že polovodič je materiál s elektrickou vodivosťou medzi kovom a izolantom.",
    "fourth_list_3": "Neskôr, keď sa zistila vzájomná súvislosť vlastností polovodiča s periodickosťou (t.j. kryštalickosťou) látky, z ktorej vyplynul tzv. model pásmového spektra elektrónov, bolo možné definovať polovodič presnejšie.",
    "fourth_list_4": "Typické polovodiče tvorené jedným prvkom (elementárne polovodiče) sú zo IV. skupiny periodickej tabuľky prvkov: Kremík, Germánium, Uhlík a Selén.",
    "fourth_list_5": "Keď sa spoja atómy, kde majú elektróny rôzne potenciálové hladiny, v zlúčenine alebo zliatine (tuhej zmesi), môžu vzniknúť efekty, ktoré pri jednoduchých polovodičoch nie sú možné. Podstatné však je, aby bola zachovaná dokonalá kryštalická mriežka.",
    "fourth_list_6": "Podľa počtu prvkov v kompozitnom polovodiči hovoríme o binárnych (2), ternárnych (3) a kvaternárnych (4) kompozitoch. V nasledujúcej tabuľke uvádzame iba niektoré z najvýznamnejších.",
    "table_column_1": "Skupina",
    "table_column_2": "Počet atómov",
    "table_column_3": "Polovodič",
    "table_column_4": "Šírka zak. pásma [eV]",
    "table_row_item_1": "C (diamant)",
    "table_row_item_2": "Ge (germánium)",
    "table_row_item_3": "Se (selén)",
    "table_row_item_4": "Te (telúr)",

    "title_kremik": "| Kremík",
    "title_5": "Kremík (Si)",
    "sub_menu_1": "Základné informácie",
    "sub_menu_2": "3D Štruktúra",
    "sub_menu_3": "Zaujímavosti",
    "title_6": "Základné informácie o kremíku",
    "table_row_item_5": "Atómové číslo",
    "table_row_item_6": "Elektronický obal",
    "table_row_item_7": "Atómová hmotnosť",
    "table_row_item_8": "Hustota",
    "table_row_item_9": "Bod topenia",
    "table_row_item_10": "Bod varu",
    "table_row_item_11": "Tepelná vodivosť",
    "table_row_item_12": "Šírka zakázaného pásma",
    "table_row_item_13": "Izotópy",
    "table_row_item_14": "Objavil",
    "first_paragraph": "Kremík je prvok na 14. mieste v Mendelejevovej periodickej tabuľke. Kryštalizuje sa v kubickej sústave s plošne centrovanou kryštálovou mriežkou. Tvorí 26 – 28% zemskej kôry, v ktorej sa nachádza hlavne vo forme oxida kremičitého (SiO2), rozličných pieskov a pod. V morskej vode je jeho koncentrácia pomerne nízka, vo vesmíre pripadá na jeden atóm kremíka približne 30 000 atómov vodíka.",
    "second_paragraph":"Má širšie zakázané pásmo (1.12 eV) ako germánium (0.67 eV), čo spôsobuje, že vodivosť kremíka je priemerne 100-krát menšia ako vodivosť germánia. Kremík má vyšší bod topenia a je lacnejší. To je hlavne v usmerňovacej a tranzistorovej technike veľkou výhodou, pretože umožňuje prácu pri podstatne vyšších teplotách. Jeho veľkou výhodou je schopnosť tvorby oxidu SiO2, ktorý umožňuje aplikovať fotolitografické postupy pri výrobe polovodičových súčiastok a slúži tiež ako výborná difúzna bariéra.",
    "title_7": "Diamantová štruktúra kremíka",
    "title_8": "Elementárna bunka",
    "rotateX": "Otáčanie podľa osi X",
    "rotateY": "Otáčanie podľa osi Y",
    "rotateZ": "Otáčanie podľa osi Z",
    "title_9": "Legenda",
    "legenda_items_1": "– Atóm kremíka",
    "legenda_items_2": "– Väzba medzi atómami",
    "legenda_items_3": "– Väzba na znázornenie elementárnej bunky",
    "title_10": "Návod na použitie",
    "manual_item_1":"Držaním a následným hýbaním kurzoru sa štruktúra otáča",
    "manual_item_2": "Kolieskom na myši a taktiež pohybom dvomi prstami na touchpade sa dá zoomovať/unzoomovat",
    "features_paragraph": "Kryštalografia definuje rôzne optické a elektrické vlastnosti materiálov a ich možné využitie pre elektronické prvky. Štruktúra kryštalického kremíka je trojrozmerné periodické zoskupenie atómov. Je dôležitá, lebo má:",
    "feature_item_1": "nižšiu absorpciu svetla,",
    "feature_item_2": "vyššiu vodivosť",
    "feature_item_3": "a menej defektov",
    "features_paragraph_end": "Diamantovú mriežku tvorí množstvo elementárnych buniek, čo je najmenšia časť priestorovej mriežky, obsahuje najmenší možný počet uzlových atómov. Pod pojmom elementárny stavebný blok myslíme objekt, ktorý je jednoduchý a bez štruktúry - ktorý sa už neskladá z ničoho menšieho, len zo seba samého.",
    "interesting_facts_1": "Tvorí 26 – 28% zemskej kôry.",
    "interesting_facts_2": "V tele dospelého človeka sa nachádza približne 1 g kremíka, a to predovšetkým v kostiach, chrupavkách a zubnej sklovine, je nevyhnutný pre ich zdravý rast a vývoj.",
    "interesting_facts_3": "Zabezpečuje elasticitu ciev, zúčastňuje sa na príjme vápnika z potravy a na raste vlasov a nechtov.",
    "interesting_facts_4": "Používa sa aj v počítačovom a mikroelektronickom priemysle.",
    "interesting_facts_5": "Stardust (misia NASA) na zachytenie častíc bez ich poškodenia používa mimoriadnu látku zvanú aerogél. Je to pevná látka na báze kremíka.",
    "interesting_facts_6": "Je hlavnou zložkou skla, cementu, keramiky a tehál.",
    "interesting_facts_7": "Je známe, že kremík tvorí zlúčeniny so 64 z 96 stabilných prvkov a prípadne tvorí silicidy s ďalšími 18 prvkami.",
    "interesting_facts_8": "Čína, Rusko, Nórsko a Brazília sú najväčšími producentmi kremíka.",

    "title_germanium": "| Germánium",
    "title_11": "Germánium (Ge)",
    "title_12": "Základné informácie o germániu",
    "paragraph_1": "Germánium je vzácny šedobiely polokovový prvok, používa sa najmä v polovodičovom priemysle. Keďže sa málokedy objavuje vo vysokej koncentrácii, germánium bolo objavené pomerne neskoro v histórii chémie. Elementárne germánium sa používa v tranzistoroch a rôznych iných elektronických zariadeniach. Historicky bolo prvé desaťročie polovodičovej elektroniky založené výlučne na germániu.",
    "paragraph_2": "Hlavné konečné použitia germánia v roku 2007 na celom svete sa odhadovali na: 35% v prípade optických vlákien, 30% infračervenej optiky, 15% polymerizačných katalyzátorov a 15% elektroniky a solárnych elektrických aplikácií. Zostávajúcich 5% sa použilo na také účely, ako sú fosfory, metalurgia a chemoterapia.",
    "paragraph_3": "Zliatiny germánia sa rýchlo stávajú dôležitým polovodičovým materiálom pre vysokorýchlostné integrované obvody. Čipy SiGe s vysokorýchlostnými vlastnosťami sa môžu vyrábať pomocou lacných, dobre zavedených výrobných techník. Solárne panely sú hlavným využitím germánia.",
    "title_13": "Diamantová štruktúra germánia",
    "legenda_items_4": "– Atóm germánia",
    "title_14": "Poznámka",
    "paragraph_4":"Diamantová štruktúra germánia sa líši od diamantovej štruktúry kremíka v tom, že vzdialenosť medzi atómami je väčšia.",
    "paragraph_5": "Kryštalografia definuje rôzne optické a elektrické vlastnosti materiálov a ich možné využitie pre elektronické prvky. Štruktúra kryštalického germánia je trojrozmerné periodické zoskupenie atómov. Je dôležitá, lebo má:",
    "list_item_1": "nižšiu absorpciu svetla,",
    "list_item_3": "vyššiu vodivosť ",
    "list_item_4": "a menej defektov",
    "paragraph_6":"Diamantovú mriežku tvorí množstvo elementárnych buniek, čo je najmenšia časť priestorovej mriežky, obsahuje najmenší možný počet uzlových atómov. Pod pojmom elementárny stavebný blok myslíme objekt, ktorý je jednoduchý a bez štruktúry - ktorý sa už neskladá z ničoho menšieho, len zo seba samého.",
    "paragraph_7": "1 - Jedna bunka 2 - Elementárna bunka",
    "inter_facts_1": "V roku 1869 Dmitrij Mendelejev predpovedal jeho existenciu a niektoré z jej vlastností z pozície v periodickej tabuľke.",
    "inter_facts_2": "Predtým, ako Winkler zverejnil svoje výsledky týkajúce sa nového prvku, rozhodol sa, že svoj prvok pomenuje neptunium, od nedávneho objavu planéty Neptún. Namiesto toho pomenoval nový prvok germánium (z latinského slova Germania pre Nemecko) na počesť svojej vlasti.",
    "inter_facts_3": "Počas druhej svetovej vojny sa malé množstvá germánia používali v niektorých špeciálnych elektronických zariadeniach, väčšinou v diódach.",
    "inter_facts_4": "Germánium je tvorené hviezdnou nukleosyntézou, bolo zistené u niektorých najvzdialenejších hviezd a v atmosfére Jupitera.",
    "inter_facts_5": "Je užitočné pre širokouhlé objektívy a mikroskopy.",
    "inter_facts_6": "Kryštály germánia vysokej čistoty sa používajú v detektoroch pre gama spektroskopiu a pri hľadaní tmavej hmoty.",
    "inter_facts_7": "Je priehľadné pre infračervené žiarenie.",

    "title_arzenid": "| Arzenid galitý",
    "title_15": "Arzenid gália (GaAs)",
    "title_16": "Základné informácie o GaAs",
    "paragraph_8": "Arzenid gália je zmes prvkov gália a arzénu. Používa sa pri výrobe zariadení, ako sú mikrovlnné frekvenčné integrované obvody, infračervené svetelné diódy, laserové diódy, solárne články a optické okná.",
    "paragraph_9": "Niektoré elektronické vlastnosti arzenidu gália sú lepšie ako vlastnosti kremíka. Má vyššiu rýchlosť nasýtenia elektrónov a vyššiu pohyblivosť elektrónov, čo umožňuje fungovanie tranzistorov arzenidu ália pri frekvenciách vyšších ako 250 GHz. Zariadenia GaAs sú vzhľadom na svoju širšiu medzeru v energetickom pásme relatívne necitlivé na teplotu. Tieto vynikajúce vlastnosti sú presvedčivými dôvodmi na použitie obvodov GaAs v mobilných telefónoch a satelitoch.",
    "paragraph_10": "Ďalšou výhodou GaAs je to, že má priamu medzeru v páse, čo znamená, že sa dá použiť na efektívnu absorpciu a vyžarovanie svetla. Kremík má nepriamu medzeru v pásme, a preto je relatívne slabý pri vyžarovaní svetla. GaAs má aj svoje nevýhody, napr. je drahý, preto sa používa kremík, ktorý je lacnejší.",
    "title_17": "Štruktúra GaAs",
    "legenda_items_5": "– Atóm gália",
    "legenda_items_6": "– Atóm arzénu",
    "title_18": "Poznámka",
    "paragraph_11":"Atómy gália a arzénu majú skoro rovnakú veľkosť, keďže ich protónové číslo a hmotnosť je skoro rovnaká.",
    "paragraph_12": "Kryštalografia definuje rôzne optické a elektrické vlastnosti materiálov a ich možné využitie pre elektronické prvky. Štruktúra kryštalického GaAs je trojrozmerné periodické zoskupenie atómov. Je dôležitá, lebo má:",
    "paragraph_13":"Diamantovú mriežku tvorí množstvo elementárnych buniek, čo je najmenšia časť priestorovej mriežky, obsahuje najmenší možný počet uzlových atómov. Pod pojmom elementárny stavebný blok myslíme objekt, ktorý je jednoduchý a bez štruktúry - ktorý sa už neskladá z ničoho menšieho, len zo seba samého.",
    "inter_facts_8": "Má veľkú rýchlosť nasýtenia elektrónov a vyššiu pohyblivosť elektrónov.",
    "inter_facts_9": "Jedným z prvých GaAs mikroprocesorov bol vyvinutý v skorých 1980.",
    "inter_facts_10": "Niektoré procesory GaAs boli implementované predajcami superpočítačov.",
    "inter_facts_11": "Prvé známe využitie solárnych článkov GaAs vo vesmíre bolo pre misiu Venera 3, ktorá sa začala v roku 1965.",
    "inter_facts_12": "Solárne články GaAs boli vybrané kvôli ich vyššiemu výkonu v prostredí s vysokou teplotou.",
    "inter_facts_13": "Zariadenia založené na GaAs držia svetový rekord pre najúčinnejšie jednokrižové solárne články na 29,1% (od roku 2019).",
    "inter_facts_14": "Diódy GaAs sa môžu použiť na detekciu röntgenových lúčov.",
    "inter_facts_15": "Takmer všetko gálium sa využíva na výrobu arzenidu galitého.",
    "inter_facts_16": "Arzenid galitý má fascinujúcu schopnosť premieňať elektrinu priamo na svetlo.",
    "inter_facts_17": "GaAs novej generácie podporuje rýchlosť signálu, ktorá je potrebná na implementáciu 5G.",
    "inter_facts_18": "Každá elektronika obsahuje malé množstvo arzénu - preto je potrebné každú elektroniku recyklovať!",

    "title_karbid": "| Karbid kremičitý",
    "title_19": "Karbid kremíka (SiC)",
    "title_20": "Základné informácie o SiC",
    "paragraph_14": "Karbid kremíka je polovodič obsahujúci kremík a uhlík. Vyskytuje sa v prírode ako mimoriadne vzácny minerál, moissanit. Syntetický prášok SiC sa vyrába od roku 1893 na vyrábanie brúsiva. Používa sa v aplikáciách vyžadujúcich vysokú vytrvalosť, ako sú automobilové brzdy, automobilové spojky a keramické dosky. SiC sa používa v polovodičových elektronických zariadeniach, ktoré pracujú pri vysokých teplotách a/alebo napätiach.",
    "paragraph_15": "Prakticky všetok karbid kremíka predávaný na svete je syntetický. Karbid kremíka existuje v asi 250 kryštalických formách. Polymorfizmus SiC sa vyznačuje veľkou rodinou podobných kryštalických štruktúr nazývaných polytypy. Najčastejšie sú: 3C, 4H, 6H. Alfa karbid kremíka (6H-SiC) je najčastejšie sa vyskytujúcim polymorfom a tvorí sa pri teplotách vyšších ako 1700 °C. Modifikácia beta (3C-SiC) s kryštálovou štruktúrou sa tvorí pri teplotách pod 1700 °C.",
    "paragraph_16": "V súčasnosti existuje veľký záujem o jeho použitie v elektronike kvôli jeho vysokej tepelnej vodivosti, vysokej odolnosti proti elektrickému poľu a vysokej maximálnej prúdovej hustote.",
    "title_21": "Štruktúra 2H - polytyp SiC",
    "legenda_items_7": "– Atóm kremíka",
    "legenda_items_8": " – Atóm uhlíka",
    "title_22": "Poznámka",
    "paragraph_17":"2H-SiC nie je najčastejšie používaný polytyp, ale z neho sa skladá 4H-SiC a 6H-SiC.",
    "paragraph_18": "Hoci existuje veľké množstvo variácií SiC, len niekoľko z nich sa vyrába v reprodukovateľnej forme a ešte menej je vhodných ako polovodiče pre elektronický priemysel. Dostupné polytypy SiC používané v priemysle sú 3C-SiC, 4H-SiC, 6H-SiC. Z dostupných polytypov je 4H-SiC v súčasnosti najpoužívanejším. Hlavnými dôvodmi sú cenová a technologická zrelosť z pomädzi ostatných polytypov.",
    "paragraph_19":"Medzná intenzita prierazného poľa pre SiC je 10-krát vyššia ako pre Si. Táto vlastnosť umožňuje použitie prvkov na báze SiC vo vysoko výkonných aplikáciách s vyššími napájacími napätiami. Väčšia šírka zakázaného pásma ďalej umožňuje SiC prvkom pracovať pri vyšších teplotách. Garantovaná prevádzková teplota súčasných SiC prvkov je v rozsahu od 150 °C do 175 °C kde je limitným parametrom materiál zapuzdrenia prvku. Správnym zapuzdrením môžu pracovať SiC prvky aj pri teplote vyššej ako 200 °C.",
    "inter_facts_19": "Elektronické aplikácie karbidu kremíka, ako sú diódy vyžarujúce svetlo (LED) a detektory sa prvýkrát demonštrovali okolo roku 1907.",
    "inter_facts_20": "Prvé použitie SiC bolo ako brúsivo, neskôr elektronické aplikácie.",
    "inter_facts_21": "Prírodný moissanit bol prvýkrát nájdený v roku 1893 ako malá súčasť meteoritu Canyon Diablo v Arizone.",
    "inter_facts_22": "Najčastejšie sa nachádza okolo hviezd bohatých na uhlík v medziplanetárnom vesmírnom prachu.",
    "inter_facts_23": "Poskytuje výhody pre rýchle, vysokoteplotné a / alebo vysokonapäťové zariadenia.",
    "inter_facts_24": "Z karbidu kremíka vyrábajú zrkadlový materiál pre astronomické teleskopy.",
    "inter_facts_25": "Vlákna z karbidu kremíka sa používajú na meranie teploty plynu.",
    "inter_facts_26": "Je podobný diamantu v niekoľkých dôležitých ohľadoch: je priehľadný a tvrdý (9–9,5 na Mohsovej stupnici v porovnaní s 10 pre diamant).",

    "title_galium": "| Gálium nitrid",
    "title_23": "Nitrid gália (GaN)",
    "title_24": "Základné informácie o GaN",
    "paragraph_20": "Nitrid gália je veľmi tvrdý materiál, ktorý má kryštalickú štruktúru Wurtzite. GaN má pásmovú medzeru širšiu ako kremík, takže dokáže udržať vyššie napätie, často sa používa aj v optoelektronických zariadení.",
    "paragraph_21": "Jeho citlivosť na ionizujúce žiarenie je nízka, čo z neho robí vhodný materiál pre solárné články v satelitoch. Keďže tranzistory GaN môžu pracovať pri oveľa vyšších teplotách a napätiach ako tranzistory s GaAs, vytvárajú ideálne zosilňovače výkonu pri mikrovlnných frekvenciách.",
    "paragraph_22": "GaN súčiastky sa dajú využiť vo výkonovej elektronike. Nabíjačky, konvertory napätia pre elektromobily a fotovoltaiku a ďalšie zariadenia môžu byť vďaka novému materiálu menšie a efektívnejšie.",
    "paragraph_23":"Tranzistory GaN sú vhodné pre vysokofrekvenčné, vysokonapäťové, vysoké teploty a vysoko účinné aplikácie. Objemový GaN je netoxický, preto sa môže používať v elektródach a elektronike implantátov v živých organizmoch.",
    "title_25": "Štruktúra GaN",
    "legenda_items_9": " – Atóm gália",
    "legenda_items_10": " – Atóm nitrogénu",
    "title_26": "Poznámka",
    "paragraph_24":"Atómy nitrogénu sú oveľa menšie, lebo protónové číslo a hmotnosť nitrogénu je oveľa menšia ako u gália.",
    "inter_facts_27": "Je jedným z mála materiálov, ktoré vyžarujú modré svetlo, preto sa využíva v modrých LED, alebo v laseroch pre Blu-ray prehrávače.",
    "inter_facts_28": "Tím vedcov z Harvard University pod vedením Danqinga Wanga vyrába miniatúrne GaN lasery veľkosti jedného mikrónu (tisíciny milimetra), ktoré sú nepozorovateľné voľným okom.",
    "inter_facts_29": "Dnes je elektronika v aute namontovaná ďaleko od motora, aby nedošlo k prílišnému prehriatiu. GaN môže toto obmedzenie eliminovať a môže otvoriť nové možnosti pre návrh áut budúcnosti.",
    "inter_facts_30": "Prach z GaN dráždi pokožku, oči a pľúca."
  },
  "en": {
    "title_index": "Home page",
    "menu_item_1": "Home",
    "menu_item_2": "Basic information",
    "menu_item_3": "Silicon",
    "menu_item_4": "Germanium",
    "menu_item_5": "Gallium arsenide",
    "menu_item_6": "Silicon carbide",
    "menu_item_7": "Gallium nitride",
    "menu_item_8": "Organic semiconductors",
    "title_1": "Welcome to the world of semiconductors!",
    "card_title_1": "Basic information",
    "card_button_1": "Find out more",
    "card_title_2": "Silicon - the king of semiconductors",
    "card_button_2": "Find out more",
    "card_title_3": "Germanium",
    "card_button_3": "Find out more",
    "card_title_4": "Gallium arsenide",
    "card_button_4": "Find out more",
    "card_title_5": "Silicon carbide",
    "card_button_5": "Find out more",
    "card_title_6": "Gallium nitride",
    "card_button_6": "Find out more",
    "card_title_7": "Organic semiconductors",
    "card_button_7": "Find out more",

    "title_uvod": "What are semiconductors?",
    "title_2": "What are semiconductors?",
    "first_list_1": "The discovery of semiconductors is considered an important discovery with great use today.",
    "first_list_2": "Semiconductors have many properties that make them important in a variety of fields, including electronics, electrical engineering, imaging, solar cells, and atomic batteries.",
    "first_list_3": "To understand the use of semiconductors, it is important to have basic knowledge about their electronic structure.",
    "carousel_item_1": "Solar cells",
    "carousel_item_2": "Diodes",
    "carousel_item_3": "Lasers",
    "second_list_1": "Semiconductors are materials that lie between conductors and non-conductors in terms of electrical conductivity.",
    "second_list_2": "Their electrical conductivity changes depending on temperature, lighting, arrangement of the crystal lattice and the presence of impurities.",
    "second_list_3": "Semiconductors have valence electrons that can move into the conduction band and move freely if given an energy that exceeds the energy gap between these bands.",
    "second_list_4": "The width of this gap determines the electrical conductivity of the substance, in conductors, this gap is zero, while in non-conductors it is large.",
    "second_list_5": "Semiconductors have the ability to conduct large currents and have low resistance at higher temperatures.",
    "title_3": "History of semiconductors",
    "third_list_1": "Some of the important properties of semiconductors have been known for a long time.",
    "third_list_2": "The photoelectric properties of selenium were already investigated in the 1860s.",
    "third_list_3": "At the end of the 19th and the beginning of the 20th century, the properties of polar semiconductors and the rectification effects of some oxides were investigated.",
    "third_list_4": "From Cu2O, in 1926 was made the first technically usable rectifier.",
    "third_list_5": "From the same semiconductor, in 1932, was also produced a photocell.",
    "third_list_6": "Despite these sporadic successes, the actual history of semiconductors actually began only in the middle of the 20th century.",
    "third_list_7": "The first prerequisite for the practical use of semiconductor materials, especially chemical ones, is almost perfect purity.",
    "third_list_8": "A huge development in the technical application of semiconductors has occurred since 1948.",
    "third_list_9": "The first transistor, a predominantly three-electrode active semiconductor device, was produced during this period. The transistor is used for signal processing, for example, for generating and amplifying electrical signals, converting non-electrical signals into electrical ones, etc.",
    "title_4": "What substances belong to semiconductors?",
    "fourth_list_1": "The answer to this question became more complicated the more semiconductors were researched.",
    "fourth_list_2": "At the beginning of the semiconductor era, it was enough to say that a semiconductor is a material with electrical conductivity between a metal and an insulator.",
    "fourth_list_3": "Later, when the interrelationship of the properties of the semiconductor with the periodicity (i.e. crystallinity) of the substance was discovered, which resulted in the so-called model of the band spectrum of electrons, it was possible to define a semiconductor more precisely.",
    "fourth_list_4": "Typical semiconductors formed by one element (elementary semiconductors) are from IV. groups of the periodic table of elements: Silicon, Germanium, Carbon and Selenium.",
    "fourth_list_5": "When atoms where electrons have different potential levels are brought together in a compound or alloy (solid mixture), effects can occur that are not possible with simple semiconductors. However, it is essential that the perfect crystal lattice is preserved.",
    "fourth_list_6": "According to the number of elements in a composite semiconductor, we talk about binary (2), ternary (3) and quaternary (4) composites. In the following table, we list only some of the most important ones.",
    "table_column_1": "Group",
    "table_column_2": "Number of atoms",
    "table_column_3": "Semiconductor",
    "table_column_4": "Width bands [eV]",
    "table_row_item_1": "C (diamond)",
    "table_row_item_2": "Ge (germanium)",
    "table_row_item_3": "Se (selenium)",
    "table_row_item_4": "Te (tellurium)",

    "title_kremik": "| Silicon",
    "title_5": "Silicon (Si)",
    "sub_menu_1": "Basic information",
    "sub_menu_2": "3D Structure",
    "sub_menu_3": "Interesting facts",
    "title_6": "Basic information about silicon",
    "table_row_item_5": "Atomic number",
    "table_row_item_6": "Electronic packaging",
    "table_row_item_7": "Atomic weight",
    "table_row_item_8": "Density",
    "table_row_item_9": "Melting point",
    "table_row_item_10": "Boiling point",
    "table_row_item_11": "Thermal conductivity",
    "table_row_item_12": "The width of the forbidden band",
    "table_row_item_13": "Isotopes",
    "table_row_item_14": "Discovered by",
    "first_paragraph": "Silicon is the 14th element in Mendeleev's periodic table. It crystallizes in a cubic system with a face-centered crystal lattice. It makes up 26-28% of the earth's crust, and it is found mainly in the form of silicon oxide, various sands, etc. In seawater, its concentration is relatively low, in space, there are approximately 30,000 hydrogen atoms for one silicon atom.",
    "second_paragraph": "It has a wider band gap (1.12 eV) than germanium (0.67 eV), which makes the conductivity of silicon on average 100 times smaller than that of germanium. Silicon has a higher melting point and is cheaper. This is a great advantage, especially in rectifier and transistor technology, because it enables work at significantly higher temperatures. Its great advantage is the ability to form silicon oxide, which enables the application of photolithographic processes in the production of semiconductor components and also serves as an excellent diffusion barrier.",
    "title_7": "Diamond structure of silicon",
    "title_8": "Elementary cell",
    "rotateX": "X-axis rotation",
    "rotateY": "Y-axis rotation",
    "rotateZ": "Z-axis rotation",
    "title_9": "The legend",
    "legenda_items_1": "– Silicon atom",
    "legenda_items_2": "– A bond between atoms",
    "legenda_items_3": "– Binding to represent the unit cell",
    "title_10": "Manual",
    "manual_item_1":"By holding and then moving the cursor, the structure rotates",
    "manual_item_2": "You can zoom/unzoom with the wheel on the mouse and also by moving two fingers on the touchpad",
    "features_paragraph": "Crystallography defines various optical and electrical properties of materials and their possible use for electronic components. The structure of crystalline silicon is a three-dimensional periodic arrangement of atoms. It is important because it has:",
    "feature_item_1": "lower light absorption,",
    "feature_item_2": "higher conductivity",
    "feature_item_3": "and fewer defects",
    "features_paragraph_end":"The diamond lattice consists of several elementary cells, which is the smallest part of the spatial lattice, and contains the smallest possible number of nodal atoms. By the term elementary building block, we mean an object that is simple and without structure - that no longer consists of anything smaller, only of itself.",
    "interesting_facts_1": "It makes up 26-28% of the earth's crust.",
    "interesting_facts_2": "There is approximately 1 g of silicon in the body of an adult, primarily in bones, cartilage, and tooth enamel, it is essential for healthy growth and development.",
    "interesting_facts_3": "It ensures the elasticity of blood vessels, participates in the intake of calcium from food, and in the growth of hair and nails.",
    "interesting_facts_4": "It is also used in the computer and microelectronics industry.",
    "interesting_facts_5": "Stardust (a NASA mission) uses a special substance called aerogel to capture the particles without damaging them. It is a silicon-based solid.",
    "interesting_facts_6": "It is the main component of glass, cement, ceramics, and bricks.",
    "interesting_facts_7": "Silicon is known to form compounds with 64 of the 96 stable elements and possibly form silicides with another 18 elements.",
    "interesting_facts_8": "China, Russia, Norway and Brazil are the largest producers of silicon.",

    "title_germanium": "| Germanium",
    "title_11": "Germanium (Ge)",
    "title_12": "Basic information about germanium",
    "paragraph_1": "Germanium is a rare gray-white semi-metallic element, mainly used in the semiconductor industry. Because it rarely appears in high concentration, germanium was discovered relatively late in the history of chemistry. Elemental germanium is used in transistors and various other electronic devices. Historically, the first decade of semiconductor electronics was based entirely on germanium.",
    "paragraph_2": "The main end uses of germanium in 2007 worldwide were estimated to be: 35% in fiber optics, 30% in infrared optics, 15% in polymerization catalysts, and 15% in electronics and solar electric applications. The remaining 5% was used for such purposes as phosphors, metallurgy and chemotherapy.",
    "paragraph_3": "Germanium alloys are rapidly becoming an important semiconductor material for high-speed integrated circuits. SiGe chips with high-speed properties can be produced using low-cost, well-established manufacturing techniques. Solar panels are the main use of germanium.",
    "title_13": "The diamond structure of germanium",
    "legenda_items_4": "– Germanium atom",
    "title_14": "Note",
    "paragraph_4":"The diamond structure of germanium differs from the diamond structure of silicon in that the distance between the atoms is greater.",
    "paragraph_5": "Crystallography defines various optical and electrical properties of materials and their possible use for electronic components. The structure of crystalline germanium is a three-dimensional periodic arrangement of atoms. It is important because it has:",
    "list_item_1": "lower light absorption,",
    "list_item_3": "higher conductivity",
    "list_item_4": "and fewer defects",
    "paragraph_6":"The diamond lattice consists of a number of elementary cells, which is the smallest part of the spatial lattice, contains the smallest possible number of nodal atoms. By the term elementary building block, we mean an object that is simple and without structure - that no longer consists of anything smaller, only of itself.",
    "paragraph_7": "1 - One cell 2 - Elementary cell",
    "inter_facts_1": "In 1869 Dmitri Mendeleev predicted its existence and some of its properties from its position in the periodic table.",
    "inter_facts_2": "Before publishing his results regarding the new element, Winkler decided to name his element neptunium, after the recent discovery of the planet Neptune. Instead, he named the new element germanium (from the Latin Germania for Germany) in honor of his homeland.",
    "inter_facts_3": "During World War II, small amounts of germanium were used in some special electronic devices, mostly diodes.",
    "inter_facts_4": "Germanium is formed by stellar nucleosynthesis, has been detected in some of the most distant stars and in the atmosphere of Jupiter.",
    "inter_facts_5": "It is useful for wide-angle lenses and microscopes.",
    "inter_facts_6": "High-purity germanium crystals are used in detectors for gamma spectroscopy and in the search for dark matter.",
    "inter_facts_7": "It is transparent to infrared radiation.",

    "title_arzenid": "| Gallium arsenide",
    "title_15": "Gallium arsenide (GaAs)",
    "title_16": "Basic information about GaAs",
    "paragraph_8": "Gallium arsenide is a mixture of the elements gallium and arsenic. It is used in the manufacture of devices such as microwave frequency integrated circuits, infrared light emitting diodes, laser diodes, solar cells and optical windows.",
    "paragraph_9": "Some electronic properties of gallium arsenide are better than those of silicon. It has a higher electron saturation speed and higher electron mobility, which allows the operation of aluminum arsenide transistors at frequencies higher than 250 GHz. GaAs devices are relatively insensitive to temperature due to their wider energy band gap. These excellent properties are compelling reasons for the use of GaAs circuits in mobile phones and satellites.",
    "paragraph_10": "Another advantage of GaAs is that it has a direct band gap, which means it can be used to efficiently absorb and emit light. Silicon has an indirect band gap and is therefore relatively weak at emitting light. GaAs also has its disadvantages, e.g. it is expensive, so silicon is used, which is cheaper.",
    "title_17": "The structure of GaAs",
    "legenda_items_5": "– Gallium atom",
    "legenda_items_6": "– Arsenic atom",
    "title_18": "Note",
    "paragraph_11":"Gallium and arsenic atoms are almost the same size since their proton number and mass are almost the same.",
    "paragraph_12": "Crystallography defines various optical and electrical properties of materials and their possible use for electronic components. The structure of crystalline GaAs is a three-dimensional periodic arrangement of atoms. It is important because it has:",
    "paragraph_13":"The diamond lattice consists of a number of elementary cells, which is the smallest part of the spatial lattice, and contains the smallest possible number of nodal atoms. By the term elementary building block, we mean an object that is simple and without structure - that no longer consists of anything smaller, only of itself.",
    "inter_facts_8": "It has a large electron saturation speed and a higher electron mobility.",
    "inter_facts_9": "One of the first GaAs microprocessors was developed in the early 1980s.",
    "inter_facts_10": "Some GaAs processors have been implemented by supercomputer vendors.",
    "inter_facts_11": "The first known use of GaAs solar cells in space was for the Venera 3 mission, launched in 1965.",
    "inter_facts_12": "GaAs solar cells were chosen due to their higher performance in high-temperature environments.",
    "inter_facts_13": "GaAs-based devices hold the world record for the most efficient single-cross solar cells at 29.1% (as of 2019).",
    "inter_facts_14": "GaAs diodes can be used to detect X-rays.",
    "inter_facts_15": "Almost all gallium is used to produce gallium arsenide.",
    "inter_facts_16": "Gallium arsenide has the fascinating ability to convert electricity directly into light.",
    "inter_facts_17": "Next-generation GaAs support the signal speed required to implement 5G.",
    "inter_facts_18": "All electronics contain small amounts of arsenic - that's why all electronics need to be recycled!",

    "title_karbid": "| Silicon carbide",
    "title_19": "Silicon carbide (SiC)",
    "title_20": "Basic information about SiC",
    "paragraph_14": "Silicon carbide is a semiconductor containing silicon and carbon. It occurs in nature as an extremely rare mineral, moissanite. Synthetic SiC powder has been produced since 1893 for the production of abrasives. It is used in high-endurance applications such as automotive brakes, automotive clutches , and ceramic plates. SiC is used in semiconductor electronic devices that operate at high temperatures and/or voltages.",
    "paragraph_15": "Virtually all silicon carbide sold in the world is synthetic. Silicon carbide exists in about 250 crystalline forms. The polymorphism of SiC is characterized by a large family of similar crystal structures called polytypes. The most common are: 3C, 4H, 6H. Alpha silicon carbide (6H-SiC) is the most frequently occurring polymorph and is formed at temperatures higher than 1700 °C. Beta modification (3C-SiC) with a crystal structure is formed at temperatures below 1700 °C.",
    "paragraph_16": "Currently, there is great interest in its use in electronics due to its high thermal conductivity, high electric field resistance, and high maximum current density.",
    "title_21": "Structure 2H - SiC polytype",
    "legenda_items_7": "– Silicon atom",
    "legenda_items_8": "– Carbon atom",
    "title_22": "Note",
    "paragraph_17":"2H-SiC is not the most commonly used polytype, but it is composed of 4H-SiC and 6H-SiC.",
    "paragraph_18": "Although there are many variations of SiC, only a few are produced in reproducible form, and even fewer are suitable as semiconductors for the electronics industry. Available SiC polytypes used in industry are 3C-SiC, 4H-SiC, 6H-SiC. Of the available polytypes, 4H-SiC is currently the most widely used. The main reasons are price and technological maturity among other polytypes.",
    "paragraph_19":"The limiting intensity of the breakdown field for SiC is 10 times higher than for Si. This property enables the use of SiC-based elements in high-performance applications with higher supply voltages. The larger band gap further allows SiC elements to operate at higher temperatures. The guaranteed operating temperature of current SiC elements is in the range from 150 °C to 175 °C, where the limiting parameter is the element encapsulation material. With proper encapsulation, SiC elements can work even at a temperature higher than 200 °C.",
    "inter_facts_19": "Electronic applications of silicon carbide such as light-emitting diodes (LEDs) and detectors were first demonstrated around 1907.",
    "inter_facts_20": "The first use of SiC was as an abrasive, later electronic applications.",
    "inter_facts_21": "Natural moissanite was first found in 1893 as a small part of the Canyon Diablo meteorite in Arizona.",
    "inter_facts_22": "It is most commonly found around carbon-rich stars in interplanetary space dust.",
    "inter_facts_23": "Provides advantages for fast, high-temperature, and/or high-voltage equipment.",
    "inter_facts_24": "They make mirror material for astronomical telescopes from silicon carbide.",
    "inter_facts_25": "Silicon carbide filaments are used to measure gas temperature.",
    "inter_facts_26": "It is similar to a diamond in several important ways: it is transparent and hard (9–9.5 on the Mohs scale compared to 10 for diamond).",

    "title_galium": "| Gallium nitride",
    "title_23": "Gallium nitride (GaN)",
    "title_24": "Basic information about GaN",
    "paragraph_20": "Gallium nitride is a very hard material that has a wurtzite crystal structure. GaN has a wider bandgap than silicon, so it can sustain higher voltages, and is often used in optoelectronic devices.",
    "paragraph_21": "Its sensitivity to ionizing radiation is low, which makes it a suitable material for solar cells in satellites. Because GaN transistors can operate at much higher temperatures and voltages than GaAs transistors, they make ideal power amplifiers at microwave frequencies.",
    "paragraph_22": "GaN components can be used in power electronics. Chargers, voltage converters for electric cars, photovoltaics, and other devices can be smaller and more efficient thanks to the new material.",
    "paragraph_23":"GaN transistors are suitable for high frequency, high voltage, high temperature, and high-efficiency applications. Bulk GaN is non-toxic, so it can be used in electrodes and implant electronics in living organisms.",
    "title_25": "GaN structure",
    "legenda_items_9": "– Gallium atom",
    "legenda_items_10": "– Nitrogen atom",
    "title_26": "Note",
    "paragraph_24":"Nitrogen atoms are much smaller because the proton number and mass of nitrogen is much smaller than that of gallium.",
    "inter_facts_27": "It is one of the few materials that emits blue light, which is why it is used in blue LEDs or in lasers for Blu-ray players.",
    "inter_facts_28": "A team of scientists from Harvard University, led by Danqing Wang, is making miniature GaN lasers one micron (thousandths of a millimeter) in size that are invisible to the naked eye.",
    "inter_facts_29": "Today, the electronics in the car are mounted far from the engine to avoid overheating. GaN can eliminate this limitation and can open up new possibilities for the design of cars of the future.",
    "inter_facts_30": "GaN dust irritates the skin, eyes and lungs."
  }
}